// Задача 3: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет
Console.WriteLine("Введите  число");
int num = Convert.ToInt32(Console.ReadLine());
if ((num % 2) > 0)  // Если остаток от деления большечем 0
{
    Console.WriteLine("Число не четное");
}
else
{
    Console.WriteLine("Число четное");
}