// // Задача 2: Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа. Не использовать строки для расчета

int num = new Random().Next(100, 1000); // задаем рандомное трехзначное число
Console.WriteLine(num); // выводим сгенерированое число
num = (num / (100)) * 10 + (num % 10);  // ищем первое и последнее число, после чего складываем
Console.WriteLine(num);